gonbey/PIC_USB_CDC_TACODRIVER/v2017_03_06/apps/usb/device/bootloaders/firmware/pic18fxxjxx/demo_src/main.c
        //Need to call USBDeviceTasks() periodically.  This function takes care of
        //processing non-USB application related USB packets (ex: "Chapter 9" 
        //packets associated with USB enumeration)
        USBDeviceTasks();

        BlinkUSBStatus();   //When enabled, blinks LEDs on the board, based on USB bus state
        
        LowVoltageCheck();  //Regularly monitor voltage to make sure it is sufficient
                            //for safe operation at full frequency and for erase/write
                            //operations.       
        
        ProcessIO();        //This is where all the actual bootloader related data transfer/self programming takes
                            //place see ProcessIO() function in the BootPIC[xxxx].c file.
    }//end while    
}    


#ifndef __XC8__
#pragma code
#endif
/******************************************************************************
 * Function:        static void InitializeSystem(void)
 *
 * PreCondition:    None
 *
 * Input:           None
 *
 * Output:          None
 *
 * Side Effects:    None
 *
 * Overview:        InitializeSystem is a centralize initialization routine.
 *                  All required USB initialization routines are called from
 *                  here.
 *
 *                  User application initialization routine should also be
 *                  called from here.                  
 *
 * Note:            None
 *****************************************************************************/
void InitializeSystem(void)
{
    //Initialize oscillator settings compatible with USB operation.  Note,
    //these may be application specific!

    //On most PIC18FxxJxx USB microcontrollers, the PLL will not power up and be enabled
    //by default, even if a PLL enabled oscillator configuration is selected (such as HS+PLL).
    //This allows the device to power up at a lower initial operating frequency, which can be
    //advantageous when powered from a source which is not gauranteed to be adequate for 48MHz
    //operation.  On these devices, user firmware needs to manually set the OSCTUNE<PLLEN> bit to
    //power up the PLL.
    #if defined(__18F24J50)||defined(__18F25J50)|| defined(__18F26J50)||defined(__18F44J50)|| defined(__18F45J50)||defined(__18F46J50)|| \
        defined(__18LF24J50)||defined(__18LF44J50)|| defined(__18LF25J50)||defined(__18LF45J50)|| \
        defined(__18LF26J50)||defined(__18LF46J50)|| defined(__18F47J53) || defined(__18F46J53) || defined(__18F27J53) || defined(__18F26J53) || \
        defined(__18LF47J53) || defined(__18LF46J53) || defined(__18LF27J53) || defined(__18LF26J53) || \
		defined(__18F87J50)||defined(__18F86J55)|| defined(__18F86J50)||defined(__18F85J50)|| \
    	defined(__18F67J50)||defined(__18F66J55)|| defined(__18F66J50)||defined(__18F65J50)

        //Clock switch to primary clock source.  Might not have been running
        //from this if the bootloader is called from the application firmware.
        OSCCON = 0x60;
        OSCTUNEbits.PLLEN = 1;  //Enable the PLL
        //Wait 2+ms until the PLL locks before enabling USB module
		DelayRoutine(0x300);
        //Device switches over automatically to PLL output after PLL is locked and ready.

        //Initialize I/O pins for "lowest" power.  When in USB suspend mode, total +5V VBUS current consumption
        //should reduce to <2.5mA in order to meet USB compliance specifications.

        //Ordinarily, to initialize I/O pins for lowest power, any unused I/O pins would be configured
        //as outputs and driven either high or low.  However, if this code is left unmodified, but is used in a real
        //application, I/O pins as outputs could cause contention with externally connected signals.  Therefore
        //this code does not actually drive unused I/Os as outputs, but uses "softer" methods, like making
        //analog capable pins as analog (to disable the digital input buffer, which wastes power when left floating)

        //This code should be replaced with code more specific to the intended target application I/O pin usage.
        //The below code by itself will not achieve the lowest possible power consumption.

        ANCON0 = 0x00;          //All analog, to disable the digital input buffers
        ANCON1 = 0x00;          //All analog, digital input buffers off, bandgap off


        #elif defined(__18F97J94) || defined(__18F87J94) || defined(__18F67J94) || defined(__18F96J99) || \
              defined(__18F86J99) || defined(__18F66J99) || defined(__18F96J94) || defined(__18F86J94) || \
              defined(__18F66J94) || defined(__18F95J94) || defined(__18F85J94) || defined(__18F65J94)
		//Turn on the HLVD module, so we can detect if the VDD voltage is/has
		//dropped below minimum "safe" level for USB bootloading operations.
	    HLVDCONbits.HLVDEN = 0;
	    HLVDCON = 0x1A;	//~2.8V trip point
	    while((HLVDCON & 0x60) != 0x60);	//Wait until BGVST and IRVST ready...
	    //Wait until VDD is consistently above the ~2.8V HLVD trip point.  If the
	    //board has allot of capacitance on it, the VDD voltage may still be ramping
	    //up, even though the microcontroller is already starting to boot up.  In this case,
	    //we want to make sure to hold off further execution until the VDD is well above
	    //the minimum required for safe USB and flash erase/program operations.
	    uint_delay_counter = 0x2800;
	    while(uint_delay_counter)
	    {
	        PIR2bits.HLVDIF = 0;    //Try to clear HLVDIF flag, hardware prevents clearing if voltage is still below trip level.
	        if(PIR2bits.HLVDIF == 1)
	        {
	            uint_delay_counter = 0x2800;
	        }
	        else
	        {
	            uint_delay_counter--;
	        }
	    }


        //Make sure to select oscillator settings consistent with USB operation.
        //If the user application firmware entered the bootloader through the absolute
        //entry point, it is possible the clock source may not have already been compatible
        //with USB operation.  In this case we need to switch as appropriate.
        OSCCON2bits.CLKLOCK = 0;    //Deassert clock setting lock
        OSCCON = 0x06;              //FRC at 500kHz selected (in case caller was running from something unknown)
        OSCCON3 = 0x01;             //FRC/2 setting (4MHz)
        OSCCON4 = 0x00;             //1:1 
        OSCCON = 0x01;              //FRC+PLL selected
       
        //Enable INTOSC active clock tuning if full speed
        ACTCON = 0x90; //Enable active clock self tuning for USB operation
        while(OSCCON2bits.LOCK == 0)      //Make sure PLL is locked/frequency is compatible
        {
            ClrWdt();
        }


