gonbey/PIC_USB_CDC_TACODRIVER/v2017_03_06/apps/usb/device/bootloaders/firmware/pic18fxxjxx/demo_src/main.c
        //Initialize I/O pins for "lowest" power.  When in USB suspend mode, total +5V VBUS current consumption
        //should reduce to <2.5mA in order to meet USB compliance specifications.
        //This code should be replaced with code more specific to the intended target application I/O pin usage.
        //The below code by itself will not achieve the lowest possible power consumption.
        //All analog
        ANCON1 = 0x00;
        ANCON2 = 0x00;
        ANCON3 = 0x00;

    #else
        #warning "Double Click this message.  Please make sure the InitializeSystem() function correctly configures your hardware platform."
        //Also make sure the correct board is selected in usb_config.h.  If
        //everything is correct, comment out the above "#error ..." line
        //to suppress the error message.
    #endif
    
	
    //The USB specifications require that USB peripheral devices must never source
    //current onto the +5V VBUS pin.  Additionally, USB peripherals should not source
    //current on D+ or D- when the host/hub is not actively powering the VBUS line.
    //When designing a self powered (as opposed to bus powered) USB peripheral
    //device, the firmware should make sure not to turn on the USB module and D+
    //or D- pull up resistor unless Vbus is actively powered.  Therefore, the
    //firmware needs some means to detect when VBUS is being powered by the host.
    //A 5V tolerant I/O pin can be connected to VBUS (through a resistor), and
    //can be used to detect when VBUS is high (host actively powering), or low
    //(host is shut down or otherwise not supplying power - note weak pull down, ex: 100k,
    //should also be placed on the PCB on VBUS to ensure low/non-floating reading).
    //The USB firmware can then periodically poll this I/O pin to know when it is okay
    //to turn on the USB module/D+/D- pull up resistor.  When designing a purely bus powered
    //peripheral device, it is not possible to source current on D+ or D- when the
    //host is not actively providing power on VBUS. Therefore, implementing this
    //bus sense feature is optional.  This firmware can be made to use this bus
    //sense feature by making sure "USE_USB_BUS_SENSE_IO" has been defined in the
    //usb_config.h file.
    #if defined(USE_USB_BUS_SENSE_IO)
        tris_usb_bus_sense = INPUT_PIN; // See HardwareProfile.h
    #endif

    //If the host PC sends a GetStatus (device) request, the firmware must respond
    //and let the host know if the USB peripheral device is currently bus powered
    //or self powered.  See chapter 9 in the official USB specifications for details
    //regarding this request.  If the peripheral device is capable of being both
    //self and bus powered, and it can consume >100mA from VBUS, it should not
    //return a hard coded value for this request.
    //Instead, firmware should check if it is currently self or bus powered, and
    //respond accordingly.  If the hardware has been configured like demonstrated
    //on the PICDEM FS USB Demo Board, an I/O pin can be polled to determine the
    //currently selected power source.  If using this feature, make sure "USE_SELF_POWER_SENSE_IO"
    //has been defined in usb_config.h, and that an appropriate I/O pin has been mapped
    //to it in HardwareProfile.h.  This feature is optionional and is not required
    //to be implemented on bus powered only or self/bus powered device that never
    //take more than 100mA from VBUS.
    #if defined(USE_SELF_POWER_SENSE_IO)
        tris_self_power = INPUT_PIN;
    #endif

    UserInit();                 //Initialize bootloader application variables (see Bootxxxx.c file)
    #if defined(ENABLE_USB_LED_BLINK_STATUS)
        mLED1 = 0;      //LED off initially
        mLED1Tris = 0;  //Configure pin as output
    #endif

	//Initialize USB module only after oscillator and other settings are compatible with USB operation
    USBDeviceInit();	//Initializes USB module SFRs and firmware
    					//variables to known states.
}//end InitializeSystem


    


/******************************************************************************
 * Function:        void BlinkUSBStatus(void)
 *
 * PreCondition:    None
 *
 * Input:           None
 *
 * Output:          None
 *
 * Side Effects:    None
 *
 * Overview:        BlinkUSBStatus turns on and off LEDs corresponding to
 *                  the USB device state.
 *
 * Note:            mLED macros can be found in HardwareProfile.h
 *                  usb_device_state is declared in usbmmap.c and is modified
 *                  in usb_device.c, usbctrltrf.c, and usb9.c
 *****************************************************************************/
void BlinkUSBStatus(void)
{
    #ifdef ENABLE_USB_LED_BLINK_STATUS
        static unsigned int led_count = 0;

        led_count--;
        if(led_count == 0)
        {
            led_count = 0x4E00;     //Value determines blink interval
            if(USBGetDeviceState() < CONFIGURED_STATE)
            {
                mLED1 = 1;          //Turn on the LED continuously
            }
            else
            {
                mLED1 = !mLED1;     //Toggle the LED state
            }
        }
    #endif //#ifdef ENABLE_USB_LED_BLINK_STATUS
}//end BlinkUSBStatus


//LVDSTAT feature only available on "F" devices (not available in "LF" devices)
#if defined(__18F46J50) || defined(__18F45J50) || defined(__18F44J50) || defined(__18F26J50) || defined(__18F25J50) || defined(__18F24J50) || defined(__18F47J53) || defined(__18F46J53) || defined(__18F27J53)  || defined(__18F26J53) || defined(__18F87J50) || defined(__18F86J55) || defined(__18F86J50)||defined(__18F85J50) || defined(__18F67J50) || defined(__18F66J55) || defined(__18F66J50) || defined(__18F65J50) 
void LowVoltageCheck(void)
{
    //Verify voltage is sufficient for safe bootloader operations.  If the
    //voltage is too low, put microcontroller to sleep to avoid potential
    //overclocking, which could cause unintended code execution (which would
    //be unsafe in a bootloader).
    if(WDTCONbits.LVDSTAT == 0)
    {
        //The voltage is too low for "safe" bootloader operation.
        //Operate at low frequency, and stay in this condition until the voltage
        //has solidly recovered back to a safe level.
        OSCCON = 0x03;          //31kHz Internal oscillator
        UCONbits.SUSPND = 0;
        UCONbits.USBEN = 0;     //Disable USB module
        INTCON = 0x00;          //Make certain interrupts cannot interrupt this code

        //Loop until the voltage has recovered sufficiently
        uint_delay_counter = 0x400;
        while(uint_delay_counter)
		{
            if(WDTCONbits.LVDSTAT == 1)
            {
                uint_delay_counter--;                
            }
            else
            {
                uint_delay_counter = 0x400;
            }
        	ClrWdt();
		}
        //If we get to here, the voltage must have risen above the trip point
        //Go ahead and reset the microcontroller so that is can resume
        //normal operation, now that the voltage is presumably sufficient (again).
        Reset();
    }       
}
#elif defined(__18F97J94) || defined(__18F87J94) || defined(__18F67J94) || defined(__18F96J99) || defined(__18F86J99) || defined(__18F66J99) || defined(__18F96J94) || defined(__18F86J94) || defined(__18F66J94) || defined(__18F95J94) || defined(__18F85J94) || defined(__18F65J94)
void LowVoltageCheck(void)
{
	//Verify voltage is sufficient for safe bootloader operations.  If the
	//voltage is too low, put microcontroller to sleep to avoid potential
	//overclocking, which could cause unintended code execution (which would
	//be unsafe in a bootloader).
	if(PIR2bits.HLVDIF == 1)
	{
		//Try to clear flag, to double check that we are currently (still)
		//below the trip point.
		PIR2bits.HLVDIF = 0;
		//Now check again to see if hardware kept it asserted because
		//we are still below the trip point.
		while(PIR2bits.HLVDIF == 1)
		{
			//The voltage is too low for "safe" bootloader operation.
			//Operate at low frequency, disable potential wake up sources  
			//and sleep indefinitely.
			OSCCON = 0x05;          //31kHz Internal oscillator
            UCONbits.SUSPND = 0;
            UCONbits.USBEN = 0;     //Disable USB module
            INTCON = 0x00;          //Make certain interrupts can interrupt this code
            DelayRoutine(0x400);    //Wait a fairly long time (ex: ~1 second)

            PIR2bits.HLVDIF = 0;    //Try to clear HLVDIF, in case the undervoltage condition has gone away
            if(PIR2bits.HLVDIF == 0)
            {
                //If we get to here, the voltage must have risen above the trip point
                //Go ahead and reset the microcontroller so that is can resume
                //normal operation, now that the voltage is presumably sufficient (again).
                OSCCON = 0x06;      //FRC at 500kHz selected
                Reset();
            }
		}
    }
}

#else
void LowVoltageCheck(void)
{
    #warning "Recommended to implement code here to check VDD.  Voltage detection can be done using ADC, HVLD, comparators, or other means."
}    
#endif








// ******************************************************************************************************
// ************** USB Callback Functions ****************************************************************
// ******************************************************************************************************
// The USB firmware stack will call the callback functions USBCBxxx() in response to certain USB related
// events.  For example, if the host PC is powering down, it will stop sending out Start of Frame (SOF)
// packets to your device.  In response to this, all USB devices are supposed to decrease their power
// consumption from the USB Vbus to <2.5mA* each.  The USB module detects this condition (which according
// to the USB specifications is 3+ms of no bus activity/SOF packets) and then calls the USBCBSuspend()
// function.  You should modify these callback functions to take appropriate actions for each of these
// conditions.  For example, in the USBCBSuspend(), you may wish to add code that will decrease power
// consumption from Vbus to <2.5mA (such as by clock switching, turning off LEDs, putting the
// microcontroller to sleep, etc.).  Then, in the USBCBWakeFromSuspend() function, you may then wish to
// add code that undoes the power saving things done in the USBCBSuspend() function.
//
// Note *: The "usb_20.pdf" specs indicate 500uA or 2.5mA, depending upon device classification. However,
// the USB-IF has officially issued an ECN (engineering change notice) changing this to 2.5mA for all
// devices.  Make sure to re-download the latest specifications to get all of the newest ECNs.

